{"recipes": {"1": {"rating": 4.68049955368042, "ingredients": ["2 cloves garlic, minced", "6 tablespoons light olive oil", "1 teaspoon dried basil", "1 teaspoon salt", "1 teaspoon ground black pepper", "1 tablespoon lemon juice", "1 tablespoon fresh parsley, chopped", "2 (6 ounce) fillets salmon"], "title": "Baked Salmon II", "minutes": 120, "instructions": "In a medium glass bowl, prepare marinade by mixing garlic, light olive oil, basil, salt, pepper, lemon juice and parsley. Place salmon fillets in a medium glass baking dish, and cover with the marinade. Marinate in the refrigerator about 1 hour, turning occasionally.\nPreheat oven to 375 degrees F (190 degrees C).\nPlace fillets in aluminum foil, cover with marinade, and seal. Place sealed salmon in the glass dish, and bake 35 to 45 minutes, until easily flaked with a fork.\n", "id": 34746, "image": "https://images.media-allrecipes.com/userphotos/560x315/593567.jpg"}, "2": {"rating": 4.6086049079895, "ingredients": ["4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness", "2 teaspoons seasoning salt", "6 slices bacon, cut in half", "1/2 cup prepared yellow mustard", "1/2 cup honey", "1/4 cup light corn syrup", "1/4 cup mayonnaise", "1 tablespoon dried onion flakes", "1 tablespoon vegetable oil", "1 cup sliced fresh mushrooms", "2 cups shredded Colby-Monterey Jack cheese", "2 tablespoons chopped fresh parsley"], "title": "Aussie Chicken", "minutes": 80, "instructions": "Rub the chicken breasts with the seasoning salt, cover and refrigerate for 30 minutes.\nPreheat oven to 350 degrees F (175 degrees C). Place bacon in a large, deep skillet. Cook over medium high heat until crisp. Set aside.\nIn a medium bowl, combine the mustard, honey, corn syrup, mayonnaise and dried onion flakes. Remove half of sauce, cover and refrigerate to serve later.\nHeat oil in a large skillet over medium heat. Place the breasts in the skillet and saute for 3 to 5 minutes per side, or until browned. Remove from skillet and place the breasts into a 9x13 inch baking dish. Apply the honey mustard sauce to each breast, then layer each breast with mushrooms and bacon. Sprinkle top with shredded cheese.\nBake in preheated oven for 15 minutes, or until cheese is melted and chicken juices run clear. Garnish with parsley and serve with the reserved honey mustard sauce.\n", "id": 18775, "image": "https://images.media-allrecipes.com/userphotos/250x250/708833.jpg"}, "3": {"rating": 4.58765411376953, "ingredients": ["1 pound ground beef", "1 egg", "1/4 cup bread crumbs", "1/8 teaspoon ground black pepper", "1/2 teaspoon seasoned salt", "1/2 teaspoon onion powder", "1/2 teaspoon garlic powder", "1 teaspoon Worcestershire sauce", "1 tablespoon vegetable oil", "1 cup thinly sliced onion", "2 tablespoons all-purpose flour", "1 cup beef broth", "1 tablespoon cooking sherry", "1/2 teaspoon seasoned salt"], "title": "Hamburger Steak with Onions and Gravy", "minutes": 40, "instructions": "In a large bowl, mix together the ground beef, egg, bread crumbs, pepper, salt, onion powder, garlic powder, and Worcestershire sauce. Form into 8 balls, and flatten into patties.\nHeat the oil in a large skillet over medium heat. Fry the patties and onion in the oil until patties are nicely browned, about 4 minutes per side. Remove the beef patties to a plate, and keep warm.\nSprinkle flour over the onions and drippings in the skillet. Stir in flour with a fork, scraping bits of beef off of the bottom as you stir. Gradually mix in the beef broth and sherry. Season with seasoned salt. Simmer and stir over medium-low heat for about 5 minutes, until the gravy thickens. Turn heat to low, return patties to the gravy, cover, and simmer for another 15 minutes.\n", "id": 78370, "image": "https://images.media-allrecipes.com/userphotos/250x250/927031.jpg"}, "4": {"rating": 4.68925142288208, "ingredients": ["1/4 cup vegetable oil", "1/3 cup honey", "1/3 cup soy sauce", "1/4 teaspoon ground black pepper", "8 skinless, boneless chicken breast halves - cut into 1 inch cubes", "2 cloves garlic", "5 small onions, cut into 2 inch pieces", "2 red bell peppers, cut into 2 inch pieces", "skewers"], "title": "Yummy Honey Chicken Kabobs", "minutes": 150, "instructions": "In a large bowl, whisk together oil, honey, soy sauce, and pepper. Before adding chicken, reserve a small amount of marinade to brush onto kabobs while cooking. Place the chicken, garlic, onions and peppers in the bowl, and marinate in the refrigerator at least 2 hours (the longer the better).\nPreheat the grill for high heat.\nDrain marinade from the chicken and vegetables, and discard marinade. Thread chicken and vegetables alternately onto the skewers.\nLightly oil the grill grate. Place the skewers on the grill. Cook for 12 to 15 minutes, until chicken juices run clear. Turn and brush with reserved marinade frequently.\n", "id": 8626, "image": "https://images.media-allrecipes.com/userphotos/560x315/1017234.jpg"}, "5": {"rating": 4.67687797546387, "ingredients": ["4 ounces linguine pasta", "2 boneless, skinless chicken breast halves, sliced into thin strips", "2 teaspoons Cajun seasoning", "2 tablespoons butter", "1 green bell pepper, chopped", "1/2 red bell pepper, chopped", "4 fresh mushrooms, sliced", "1 green onion, minced", "1 1/2 cups heavy cream", "1/4 teaspoon dried basil", "1/4 teaspoon lemon pepper", "1/4 teaspoon salt", "1/8 teaspoon garlic powder", "1/8 teaspoon ground black pepper", "2 tablespoons grated Parmesan cheese"], "title": "Cajun Chicken Pasta", "minutes": 30, "instructions": "Bring a large pot of lightly salted water to a boil. Add linguini pasta, and cook for 8 to 10 minutes, or until al dente; drain.\nMeanwhile, place chicken and Cajun seasoning in a bowl, and toss to coat.\nIn a large skillet over medium heat, saute chicken in butter until no longer pink and juices run clear, about 5 to 7 minutes. Add green and red bell peppers, sliced mushrooms and green onions; cook for 2 to 3 minutes. Reduce heat, and stir in heavy cream. Season the sauce with basil, lemon pepper, salt, garlic powder and ground black pepper, and heat through.\nIn a large bowl, toss linguini with sauce. Sprinkle with grated Parmesan cheese.\n", "id": 12009, "image": "https://images.media-allrecipes.com/userphotos/560x315/4421034.jpg"}}}