{"recipes": {"1": {"rating": 4.46764469146729, "ingredients": ["1 bunch kale", "1 tablespoon olive oil", "1 teaspoon seasoned salt"], "title": "Baked Kale Chips", "minutes": 20, "instructions": "Preheat an oven to 350 degrees F (175 degrees C). Line a non insulated cookie sheet with parchment paper.\nWith a knife or kitchen shears carefully remove the leaves from the thick stems and tear into bite size pieces. Wash and thoroughly dry kale with a salad spinner. Drizzle kale with olive oil and sprinkle with seasoning salt.\nBake until the edges brown but are not burnt, 10 to 15 minutes.\n", "id": 176957, "image": "https://images.media-allrecipes.com/userphotos/250x250/490832.jpg"}, "2": {"rating": 4.5335841178894, "ingredients": ["2 cups rolled oats", "3/4 cup packed brown sugar", "1/2 cup wheat germ", "3/4 teaspoon ground cinnamon", "1 cup all-purpose flour", "3/4 cup raisins (optional)", "3/4 teaspoon salt", "1/2 cup honey", "1 egg, beaten", "1/2 cup vegetable oil", "2 teaspoons vanilla extract"], "title": "Playgroup Granola Bars", "minutes": 50, "instructions": "Preheat the oven to 350 degrees F (175 degrees C). Generously grease a 9x13 inch baking pan.\nIn a large bowl, mix together the oats, brown sugar, wheat germ, cinnamon, flour, raisins and salt. Make a well in the center, and pour in the honey, egg, oil and vanilla. Mix well using your hands. Pat the mixture evenly into the prepared pan.\nBake for 30 to 35 minutes in the preheated oven, until the bars begin to turn golden at the edges. Cool for 5 minutes, then cut into bars while still warm. Do not allow the bars to cool completely before cutting, or they will be too hard to cut.\n", "id": 81298, "image": "https://images.media-allrecipes.com/userphotos/250x250/125805.jpg"}, "3": {"rating": 4.61026763916016, "ingredients": ["1/4 cup vegetable oil", "1/4 cup white sugar", "1/2 cup unpopped popcorn kernels"], "title": "Kettle Corn", "minutes": 20, "instructions": "Heat the vegetable oil in a large pot over medium heat. Once hot, stir in the sugar and popcorn. Cover, and shake the pot constantly to keep the sugar from burning. Once the popping has slowed to once every 2 to 3 seconds, remove the pot from the heat and continue to shake for a few minutes until the popping has stopped. Pour into a large bowl, and allow to cool, stirring occasionally to break up large clumps.\n", "id": 20808, "image": "https://images.media-allrecipes.com/userphotos/560x315/699723.jpg"}, "4": {"rating": 4.51446962356567, "ingredients": ["1 tablespoon vegetable oil", "1 potato, sliced paper thin (peel optional)", "1/2 teaspoon salt, or to taste"], "title": "Potato Chips", "minutes": 35, "instructions": "Pour the vegetable oil into a plastic bag (a produce bag works well). Add the potato slices, and shake to coat.\nCoat a large dinner plate lightly with oil or cooking spray. Arrange potato slices in a single layer on the dish.\nCook in the microwave for 3 to 5 minutes, or until lightly browned (if not browned, they will not become crisp). Times will vary depending on the power of your microwave. Remove chips from plate, and toss with salt (or other seasonings). Let cool. Repeat process with the remaining potato slices. You will not need to keep oiling the plate.\n", "id": 66646, "image": "https://images.media-allrecipes.com/userphotos/560x315/969840.jpg"}, "5": {"rating": 4.7239818572998, "ingredients": ["18 jumbo black olives, pitted", "1 (8 ounce) package cream cheese, softened", "18 small black olives", "1 carrot"], "title": "Cream Cheese Penguins", "minutes": 35, "instructions": "Cut a slit from top to bottom, lengthwise, into the side of each jumbo olive. Carefully insert about 1 teaspoon of cream cheese into each olive. Slice the carrot into eighteen 1/4 inch thick rounds; cut a small notch out of each carrot slice to form feet. Save the cut out piece and press into center of small olive to form the beak. If necessary cut a small slit into each olive before inserting the beak.\nSet a big olive, large hole side down, onto a carrot slice. Then, set a small olive onto the large olive, adjusting so that the beak, cream cheese chest and notch in the carrot slice line up. Secure with a toothpick.\n", "id": 19687, "image": "https://images.media-allrecipes.com/userphotos/560x315/580469.jpg"}}}