{"recipes": {"1": {"rating": 4.67326736450195, "ingredients": ["1/3 cup balsamic vinegar", "1/4 cup olive oil", "1 tablespoon minced garlic", "6 portobello mushroom caps", "1/2 cup mayonnaise", "1 tablespoon Dijon mustard", "1 teaspoon lemon juice", "2 tablespoons chopped fresh basil", "6 kaiser rolls, split, toasted", "1 tablespoon butter", "6 leaves lettuce", "6 tomato slices"], "title": "Grilled Portobello with Basil Mayonnaise Sandwich", "minutes": 25, "instructions": "Preheat an outdoor grill for medium heat, and lightly oil the grate. Whisk together the balsamic vinegar, olive oil, and garlic in a small bowl.\nArrange the portobello mushrooms gill-side up on a tray or baking sheet. Brush the mushrooms with some of the vinegar mixture, and allow to marinate for 3 to 5 minutes.\nPlace the marinated mushrooms on the preheated grill, gill-side down. Grill mushrooms until tender, brushing both sides of the mushrooms with the remaining marinade, about 4 minutes on each side.\nMix the mayonnaise, dijon mustard, lemon juice, and basil in a small bowl. Butter the toasted kaiser rolls, then spread with the mayonnaise mixture. Divide the mushrooms, lettuce, and tomato slices evenly to make 6 sandwiches.\n", "id": 214903, "image": "https://images.media-allrecipes.com/userphotos/560x315/672533.jpg"}, "2": {"rating": 4.65714263916016, "ingredients": ["2 (9 ounce) packages refrigerated three-cheese tortellini", "1 pound bacon", "4 cups chopped broccoli", "1 pint grape tomatoes, halved", "2 green onions, finely chopped", "1 cup bottled coleslaw dressing"], "title": "Tortellini Bacon Broccoli Salad", "minutes": 90, "instructions": "Cook the tortellini according to the package directions, drain, rinse with cold water, and refrigerate until cool, about 30 minutes.\nPlace the bacon in a large, deep skillet, and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain the bacon slices on a paper towel-lined plate. Chop the bacon into 1/2-inch pieces while still a little warm.\nPlace the tortellini, bacon, broccoli, grape tomatoes, and green onions into a salad bowl. Pour the dressing over the ingredients, and toss lightly to coat. Chill in refrigerator before serving.\n", "id": 213230, "image": "https://images.media-allrecipes.com/userphotos/560x315/866251.jpg"}, "3": {"rating": 4.76233816146851, "ingredients": ["1 (16 ounce) bag coleslaw mix", "2 tablespoons diced onion", "2/3 cup creamy salad dressing (such as Miracle Whip™)", "3 tablespoons vegetable oil", "1/2 cup white sugar", "1 tablespoon white vinegar", "1/4 teaspoon salt", "1/2 teaspoon poppy seeds"], "title": "Sweet Restaurant Slaw", "minutes": 135, "instructions": "Combine the coleslaw mix and onion in a large bowl.\nWhisk together the salad dressing, vegetable oil, sugar, vinegar, salt, and poppy seeds in a medium bowl; blend thoroughly. Pour dressing mixture over coleslaw mix and toss to coat. Chill at least 2 hours before serving.\n", "id": 142027, "image": "https://images.media-allrecipes.com/userphotos/560x315/2276935.jpg"}, "4": {"rating": 4.80868530273438, "ingredients": ["1 pound bulk mild Italian sausage", "1 1/4 teaspoons crushed red pepper flakes", "4 slices bacon, cut into 1/2 inch pieces", "1 large onion, diced", "1 tablespoon minced garlic", "5 (13.75 ounce) cans chicken broth", "6 potatoes, thinly sliced", "1 cup heavy cream", "1/4 bunch fresh spinach, tough stems removed"], "title": "Super-Delicious Zuppa Toscana", "minutes": 85, "instructions": "Cook the Italian sausage and red pepper flakes in a Dutch oven over medium-high heat until crumbly, browned, and no longer pink, 10 to 15 minutes. Drain and set aside.\nCook the bacon in the same Dutch oven over medium heat until crisp, about 10 minutes. Drain, leaving a few tablespoons of drippings with the bacon in the bottom of the Dutch oven. Stir in the onions and garlic; cook until onions are soft and translucent, about 5 minutes.\nPour the chicken broth into the Dutch oven with the bacon and onion mixture; bring to a boil over high heat. Add the potatoes, and boil until fork tender, about 20 minutes. Reduce the heat to medium and stir in the heavy cream and the cooked sausage; heat through. Mix the spinach into the soup just before serving.\n", "id": 143069, "image": "https://images.media-allrecipes.com/userphotos/560x315/1115547.jpg"}, "5": {"rating": 4.53702735900879, "ingredients": ["1 (7 ounce) can white tuna, drained and flaked", "6 tablespoons mayonnaise or salad dressing", "1 tablespoon Parmesan cheese", "3 tablespoons sweet pickle relish", "1/8 teaspoon dried minced onion flakes", "1/4 teaspoon curry powder", "1 tablespoon dried parsley", "1 teaspoon dried dill weed", "1 pinch garlic powder"], "title": "Barbie's Tuna Salad", "minutes": 10, "instructions": "In a medium bowl, stir together the tuna, mayonnaise, Parmesan cheese, and onion flakes. Season with curry powder, parsley, dill and garlic powder. Mix well and serve with crackers or on a sandwich.\n", "id": 98579, "image": "https://images.media-allrecipes.com/userphotos/560x315/4539967.jpg"}}}