{"recipes": {"1": {"rating": 4.51357316970825, "ingredients": ["6 green bell peppers", "salt to taste", "1 pound ground beef", "1/3 cup chopped onion", "salt and pepper to taste", "1 (14.5 ounce) can whole peeled tomatoes, chopped", "1 teaspoon Worcestershire sauce", "1/2 cup uncooked rice", "1/2 cup water", "1 cup shredded Cheddar cheese", "2 (10.75 ounce) cans condensed tomato soup", "water as needed"], "title": "Stuffed Green Peppers I", "minutes": 60, "instructions": "Bring a large pot of salted water to a boil. Cut the tops off the peppers, and remove the seeds. Cook peppers in boiling water for 5 minutes; drain. Sprinkle salt inside each pepper, and set aside.\nIn a large skillet, saute beef and onions for 5 minutes, or until beef is browned. Drain off excess fat, and season with salt and pepper. Stir in the tomatoes, rice, 1/2 cup water and Worcestershire sauce. Cover, and simmer for 15 minutes, or until rice is tender. Remove from heat, and stir in the cheese.\nPreheat the oven to 350 degrees F. (175 degrees C). Stuff each pepper with the beef and rice mixture, and place peppers open side up in a baking dish. In a medium bowl, combine tomato soup with just enough water to make the soup a gravy consistency. Pour over the peppers.\nBake covered for 25 to 35 minutes, until heated through and cheese is melted and bubbly.\n", "id": 17991, "image": "https://images.media-allrecipes.com/userphotos/560x315/452169.jpg"}, "2": {"rating": 4.79172801971436, "ingredients": ["6 cups chicken broth, divided", "3 tablespoons olive oil, divided", "1 pound portobello mushrooms, thinly sliced", "1 pound white mushrooms, thinly sliced", "2 shallots, diced", "1 1/2 cups Arborio rice", "1/2 cup dry white wine", "sea salt to taste", "freshly ground black pepper to taste", "3 tablespoons finely chopped chives", "4 tablespoons butter", "1/3 cup freshly grated Parmesan cheese"], "title": "Gourmet Mushroom Risotto", "minutes": 50, "instructions": "In a saucepan, warm the broth over low heat.\nWarm 2 tablespoons olive oil in a large saucepan over medium-high heat. Stir in the mushrooms, and cook until soft, about 3 minutes. Remove mushrooms and their liquid, and set aside.\nAdd 1 tablespoon olive oil to skillet, and stir in the shallots. Cook 1 minute. Add rice, stirring to coat with oil, about 2 minutes. When the rice has taken on a pale, golden color, pour in wine, stirring constantly until the wine is fully absorbed. Add 1/2 cup broth to the rice, and stir until the broth is absorbed. Continue adding broth 1/2 cup at a time, stirring continuously, until the liquid is absorbed and the rice is al dente, about 15 to 20 minutes.\nRemove from heat, and stir in mushrooms with their liquid, butter, chives, and parmesan. Season with salt and pepper to taste.\n", "id": 85389, "image": "https://images.media-allrecipes.com/userphotos/560x315/246711.jpg"}, "3": {"rating": 4.71717929840088, "ingredients": ["2 pounds skinless, boneless chicken breast meat - cut into chunks", "1 (10.75 ounce) can condensed cream of chicken soup", "1 1/4 cups sour cream", "1/4 teaspoon chili powder", "1 tablespoon butter", "1 small onion, chopped", "1 (4 ounce) can chopped green chilies, drained", "1 (1.25 ounce) package mild taco seasoning mix", "1 bunch green onions, chopped, divided", "1 cup water", "1 teaspoon lime juice", "1/2 teaspoon onion powder", "1/2 teaspoon garlic powder", "5 (12 inch) flour tortillas", "3 cups Cheddar cheese, shredded, divided", "1 (10 ounce) can enchilada sauce", "1 (6 ounce) can sliced black olives"], "title": "Angela's Awesome Enchiladas", "minutes": 105, "instructions": "Place the chicken in a large pot and add water to cover. Bring to a boil over high heat, then reduce the heat to medium-low, cover, and simmer until the chicken pieces are no longer pink, about 10 minutes. Shred chicken by placing two forks back to back and pulling meat apart. Set the shredded chicken aside. Meanwhile, combine the cream of chicken soup, sour cream, and chili powder in a saucepan. Bring to a simmer over low heat, stirring occasionally, then turn off the heat and cover to keep warm.\nHeat the butter in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the shredded chicken, chopped green chilies, taco seasoning, half of the bunch of chopped green onion, and water. Allow to simmer for 10 minutes. Stir in the lime juice, onion powder, and garlic powder; simmer for an additional 10 minutes.\nPreheat an oven to 350 degrees F (175 degrees C). Stir 1 cup of the soup mixture into the skillet with the chicken mixture. Spread the remaining soup mixture on the bottom of a 9x13 inch baking dish.\nFill each tortilla with chicken mixture. Sprinkle Cheddar cheese over the chicken filling before folding the tortillas, reserving half of the shredded cheese for topping the enchiladas. Fold tortillas over the filling and place seam-side down in the prepared pan.\nPour enchilada sauce evenly over the enchiladas. Cover with the remaining 1 1/2 cups of Cheddar cheese. Sprinkle the reserved chopped green onions and the sliced olives on top of the cheese. Bake in the preheated oven until filling is heated through and the cheese is melted and bubbling, about 25 minutes.\n", "id": 83549, "image": "https://images.media-allrecipes.com/userphotos/560x315/683438.jpg"}, "4": {"rating": 4.55798768997192, "ingredients": ["3 tablespoons honey", "3 tablespoons soy sauce", "3 tablespoons balsamic vinegar", "1 teaspoon grated fresh ginger root", "1 clove garlic, crushed or to taste", "2 teaspoons olive oil", "4 (6 ounce) mahi mahi fillets", "salt and pepper to taste", "1 tablespoon vegetable oil"], "title": "Ginger Glazed Mahi Mahi", "minutes": 37, "instructions": "In a shallow glass dish, stir together the honey, soy sauce, balsamic vinegar, ginger, garlic and olive oil. Season fish fillets with salt and pepper, and place them into the dish. If the fillets have skin on them, place them skin side down. Cover, and refrigerate for 20 minutes to marinate.\nHeat vegetable oil in a large skillet over medium-high heat. Remove fish from the dish, and reserve marinade. Fry fish for 4 to 6 minutes on each side, turning only once, until fish flakes easily with a fork. Remove fillets to a serving platter and keep warm.\nPour reserved marinade into the skillet, and heat over medium heat until the mixture reduces to a glaze consistently. Spoon glaze over fish, and serve immediately.\n", "id": 45833, "image": "https://images.media-allrecipes.com/userphotos/560x315/958722.jpg"}, "5": {"rating": 4.82454109191895, "ingredients": ["4 skinless, boneless chicken breast halves - cooked and diced", "1 stalk celery, diced", "4 green onions, chopped", "1 Golden Delicious apple - peeled, cored and diced", "1/3 cup golden raisins", "1/3 cup seedless green grapes, halved", "1/2 cup chopped toasted pecans", "1/8 teaspoon ground black pepper", "1/2 teaspoon curry powder", "3/4 cup light mayonnaise"], "title": "Fruity Curry Chicken Salad", "minutes": 45, "instructions": "In a large bowl combine the chicken, celery, onion, apple, raisins, grapes, pecans, pepper, curry powder and mayonnaise. Mix all together. Serve!\n", "id": 8932, "image": "https://images.media-allrecipes.com/userphotos/560x315/1103604.jpg"}}}