{"recipes": {"1": {"rating": 4.56046199798584, "ingredients": ["2 pounds ground beef", "1 onion, chopped", "2 teaspoons minced garlic", "1 (2 ounce) can black olives, sliced", "1 (4 ounce) can diced green chili peppers", "1 (10 ounce) can diced tomatoes with green chile peppers", "1 (16 ounce) jar taco sauce", "2 (16 ounce) cans refried beans", "12 (8 inch) flour tortillas", "9 ounces shredded Colby cheese"], "title": "Burrito Pie", "minutes": 60, "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nIn a large skillet over medium heat, saute the ground beef for 5 minutes. Add the onion and garlic, and saute for 5 more minutes. Drain any excess fat, if desired. Mix in the olives, green chile peppers, tomatoes with green chile peppers, taco sauce and refried beans. Stir mixture thoroughly, reduce heat to low, and let simmer for 15 to 20 minutes.\nSpread a thin layer of the meat mixture in the bottom of a 4 quart casserole dish. Cover with a layer of tortillas followed by more meat mixture, then a layer of cheese. Repeat tortilla, meat, cheese pattern until all the tortillas are used, topping off with a layer of meat mixture and cheese.\nBake for 20 to 30 minutes in the preheated oven, or until cheese is slightly brown and bubbly.\n", "id": 16881, "image": "https://images.media-allrecipes.com/userphotos/560x315/392583.jpg"}, "2": {"rating": 4.61992311477661, "ingredients": ["1 pound extra lean ground beef", "1/2 teaspoon sea salt", "1 small onion, diced", "1/2 teaspoon garlic salt", "1 1/2 teaspoons Italian seasoning", "3/4 teaspoon dried oregano", "3/4 teaspoon crushed red pepper flakes", "1 dash hot pepper sauce (such as Frank's RedHot®), or to taste", "1 1/2 tablespoons Worcestershire sauce", "1/3 cup skim milk", "1/4 cup grated Parmesan cheese", "1/2 cup seasoned bread crumbs"], "title": "Meatball Nirvana", "minutes": 40, "instructions": "Preheat an oven to 400 degrees F (200 degrees C).\nPlace the beef into a mixing bowl, and season with salt, onion, garlic salt, Italian seasoning, oregano, red pepper flakes, hot pepper sauce, and Worcestershire sauce; mix well. Add the milk, Parmesan cheese, and bread crumbs. Mix until evenly blended, then form into 1 1/2-inch meatballs, and place onto a baking sheet.\nBake in the preheated oven until no longer pink in the center, 20 to 25 minutes.\n", "id": 213742, "image": "https://images.media-allrecipes.com/userphotos/560x315/397070.jpg"}, "3": {"rating": 4.7855749130249, "ingredients": ["1 (14 ounce) can beef broth", "3 pounds boneless pork ribs", "1 (18 ounce) bottle barbeque sauce"], "title": "BBQ Pork for Sandwiches", "minutes": 285, "instructions": "Pour can of beef broth into slow cooker, and add boneless pork ribs. Cook on High heat for 4 hours, or until meat shreds easily. Remove meat, and shred with two forks. It will seem that it's not working right away, but it will.\nPreheat oven to 350 degrees F (175 degrees C). Transfer the shredded pork to a Dutch oven or iron skillet, and stir in barbeque sauce.\nBake in the preheated oven for 30 minutes, or until heated through.\n", "id": 21174, "image": "https://images.media-allrecipes.com/userphotos/560x315/18978.jpg"}, "4": {"rating": 4.68387079238892, "ingredients": ["1 (12 ounce) package bow tie pasta", "2 tablespoons olive oil", "1 pound sweet Italian sausage, casings removed and crumbled", "1/2 teaspoon red pepper flakes", "1/2 cup diced onion", "3 cloves garlic, minced", "1 (28 ounce) can Italian-style plum tomatoes, drained and coarsely chopped", "1 1/2 cups heavy cream", "1/2 teaspoon salt", "3 tablespoons minced fresh parsley"], "title": "Bow Ties with Sausage, Tomatoes and Cream", "minutes": 45, "instructions": "Bring a large pot of lightly salted water to a boil. Cook pasta in boiling water for 8 to 10 minutes, or until al dente; drain.\nHeat oil in a large, deep skillet over medium heat. Cook sausage and pepper flakes until sausage is evenly brown. Stir in onion and garlic, and cook until onion is tender. Stir in tomatoes, cream, and salt. Simmer until mixture thickens, 8 to 10 minutes.\nStir cooked pasta into sauce, and heat through. Sprinkle with parsley.\n", "id": 26257, "image": "https://images.media-allrecipes.com/userphotos/560x315/122627.jpg"}, "5": {"rating": 4.7582221031189, "ingredients": ["3 cloves garlic, minced", "1/3 cup olive oil", "1/4 cup tomato sauce", "2 tablespoons red wine vinegar", "2 tablespoons chopped fresh basil", "1/2 teaspoon salt", "1/4 teaspoon cayenne pepper", "2 pounds fresh shrimp, peeled and deveined", "skewers"], "title": "Marinated Grilled Shrimp", "minutes": 55, "instructions": "In a large bowl, stir together the garlic, olive oil, tomato sauce, and red wine vinegar. Season with basil, salt, and cayenne pepper. Add shrimp to the bowl, and stir until evenly coated. Cover, and refrigerate for 30 minutes to 1 hour, stirring once or twice.\nPreheat grill for medium heat. Thread shrimp onto skewers, piercing once near the tail and once near the head. Discard marinade.\nLightly oil grill grate. Cook shrimp on preheated grill for 2 to 3 minutes per side, or until opaque.\n", "id": 21694, "image": "https://images.media-allrecipes.com/userphotos/560x315/1248063.jpg"}}}