{"recipes": {"1": {"rating": 4.43181800842285, "ingredients": ["9 slices bread, torn into bite size pieces", "1/2 cup diced fresh mushrooms", "1/2 cup chopped green bell pepper", "16 ounces Cheddar cheese, shredded", "1/2 cup chopped onion", "2 cups cubed cooked ham", "8 eggs", "2 cups milk"], "title": "Mom's Breakfast Strata", "minutes": 790, "instructions": "Grease a 9x13 inch baking dish. Layer half of the torn bread in the bottom of the dish. Sprinkle the mushrooms and green bell pepper evenly over the bread layer. Sprinkle with half of the cheese. Top with remaining bread pieces, then layer with the onion and ham. Sprinkle with remaining cheese. Whisk together eggs and milk; pour over the entire pan. Cover with aluminum foil, and refrigerate for 12 to 24 hours.\nPreheat the oven to 350 degrees F (175 degrees C).\nBake covered for 35 minutes, then remove foil and bake for an additional 15 minutes, or until top is evenly brown.\n", "id": 33174, "image": "https://images.media-allrecipes.com/userphotos/250x250/58767.jpg"}, "2": {"rating": 4.55932188034058, "ingredients": ["2 teaspoons butter", "2 eggs", "1 slice sourdough bread, toasted", "Dijon mustard", "1/2 avocado - peeled, pitted, and sliced", "2 tablespoons grated Parmesan cheese, or more to taste"], "title": "Perfect Breakfast", "minutes": 15, "instructions": "Melt 2 teaspoons butter in a skillet over medium heat; add the eggs. Allow the egg whites to cook until mostly firm before breaking the yolks; continue cooking until eggs are completely cooked and no longer runny, 2 to 3 minutes.\nSpread one side of toasted sourdough bread slice with Dijon mustard.\nArrange avocado slice onto the mustard.\nTop avocado with cooked eggs.\nSprinkle Parmesan cheese over eggs.\n", "id": 221304, "image": "https://images.media-allrecipes.com/userphotos/560x315/2269682.jpg"}, "3": {"rating": 4.51764726638794, "ingredients": ["6 ounces chorizo sausage", "8 (6 inch) corn tortillas", "6 eggs", "1/4 cup milk", "1/2 teaspoon pepper", "1/2 teaspoon salt", "1 cup shredded Monterey Jack cheese", "1 dash hot pepper sauce (e.g. Tabasco™), or to taste", "1/2 cup salsa"], "title": "Authentic Mexican Breakfast Tacos", "minutes": 15, "instructions": "Crumble the sausage into a skillet over medium-high heat. Cook and stir until evenly brown. Set aside.\nHeat one skillet over medium heat, and heat another skillet over high heat. The skillet over high heat is for warming tortillas. In a medium bowl, whisk together the eggs, milk, salt and pepper. Spray the medium heat skillet with some cooking spray, and pour in the eggs. Cook and stir until almost firm. Add the sausage, and continue cooking and stirring until firm.\nMeanwhile, warm tortillas for about 45 seconds per side in the other skillet, so they are hot and crispy on the edges, but still pliable.\nSprinkle a little shredded cheese onto each tortilla while it is still hot. Top with some of the scrambled egg and sausage, then add hot pepper sauce and salsa to your liking.\n", "id": 85185, "image": "https://images.media-allrecipes.com/userphotos/560x315/19492.jpg"}, "4": {"rating": 4.50799989700317, "ingredients": ["2 (12 ounce) packages frozen hash brown potatoes", "1/3 cup butter, melted", "1 cup cooked diced ham", "1 cup shredded Monterey Jack cheese", "2 eggs", "1/2 cup heavy whipping cream"], "title": "Ham and Cheese Breakfast Quiche", "minutes": 75, "instructions": "Preheat oven to 425 degrees F (220 degrees C).\nSqueeze any excess moisture from the potatoes and combine them with the melted butter or margarine in a small bowl. Press this mixture into the bottom and sides of an ungreased 10 inch pie pan.\nBake at 425 degrees F (220 degrees C) for 25 minutes.\nRemove pan from oven and arrange the ham and cheese evenly over the potatoes. In a separate small bowl, beat together the eggs and the cream. Pour this over the ham and cheese.\nReturn pan to oven and bake for 425 degrees F (220 degrees C) for 30 minutes, or until the custard has completely set.\n", "id": 16375, "image": "https://images.media-allrecipes.com/userphotos/560x315/16129.jpg"}, "5": {"rating": 4.50883817672729, "ingredients": ["4 pounds rump roast", "1 (10.5 ounce) can beef broth", "1 (10.5 ounce) can condensed French onion soup", "1 (12 fluid ounce) can or bottle beer", "6 French rolls", "2 tablespoons butter"], "title": "Easy Slow Cooker French Dip", "minutes": 430, "instructions": "Trim excess fat from the rump roast, and place in a slow cooker. Add the beef broth, onion soup and beer. Cook on Low setting for 7 hours.\nPreheat oven to 350 degrees F (175 degrees C).\nSplit French rolls, and spread with butter. Bake 10 minutes, or until heated through.\nSlice the meat on the diagonal, and place on the rolls. Serve the sauce for dipping.\n", "id": 16239, "image": "https://images.media-allrecipes.com/userphotos/560x315/10316.jpg"}}}