{"image": "https://images.media-allrecipes.com/userphotos/560x315/4557431.jpg", "rating": 5.0, "minutes": 62, "ingredients": ["Cupcakes:", "2 cups white sugar", "2 cups all-purpose flour, sifted", "1 cup unsweetened cocoa powder", "2 teaspoons baking powder", "1 teaspoon salt", "1/2 teaspoon baking soda", "1 cup buttermilk", "1/2 cup vegetable oil", "2 eggs", "1 teaspoon vanilla extract", "1 cup hot water", "Frosting:", "3/4 cup heavy whipping cream", "1 1/2 tablespoons heavy whipping cream", "1 1/2 cups mascarpone cheese", "2 tablespoons mascarpone cheese", "7 tablespoons unsweetened cocoa powder", "1/4 cup white sugar", "Decoration:", "48 chocolate sandwich cookies (such as Oreo®)", "48 brown candy-coated milk chocolate pieces (such as M&M;'s®)", "24 orange or yellow candy-coated milk chocolate pieces (such as M&M;'s®)"], "title": "Owl Cupcakes", "instructions": "Preheat oven to 350 degrees F (175 degrees C). Line 2 muffin tins with paper liners.\nCombine 2 cups sugar, flour, 1 cup cocoa powder, baking powder, salt, and baking soda in a bowl.\nWhisk buttermilk, vegetable oil, eggs, and vanilla extract in a large bowl. Add flour mixture; mix until well-combined. Pour in hot water; stir until batter is smooth. Divide batter evenly among muffin tins.\nBake in the preheated oven until a toothpick inserted into the center comes out clean, about 12 minutes. Transfer cupcakes to a wire rack and let cool completely, about 20 minutes.\nWhip 3/4 cup plus 1 1/2 tablespoon heavy cream in a bowl with an electric mixer until soft peaks form. Fold in 1 1/2 cup plus 2 tablespoons mascarpone cheese, 7 tablespoons cocoa powder, and 1/4 cup sugar gently to make frosting.\nSpread 1 tablespoon frosting over each cooled cupcake.\nTwist chocolate sandwich cookies open, leaving all cream filling on 1 side. Place 2 cookies, cream filling-side up, on each cupcake to make owl eyes. Place a brown milk chocolate piece on each cookie to create pupils. Insert an orange or yellow milk chocolate piece in the center to make a beak.\n"}