{"image": "https://images.media-allrecipes.com/userphotos/560x315/5049088.jpg", "calories": "647", "rating": 4.19999980926514, "instructions": "Preheat oven to 350 degrees F (175 degrees C).\nHeat olive oil in a large skillet over medium heat; cook and stir carrots, onion, mushrooms, and celery until vegetables start to become tender, about 8 minutes. Spread vegetables into the bottom of a large, deep baking dish, retaining olive oil in skillet.\nCombine kosher salt, black pepper, chili powder, cinnamon, nutmeg, allspice, cloves, and cayenne pepper in a resealable plastic bag. Pat brisket dry with paper towels and rub spice mixture all over the meat.\nSear seasoned brisket in skillet over medium-high heat on all sides until browned and spice rub has formed a crust, about 2 minutes per side. Lay the seared brisket on top of the vegetables in the baking dish.\nPour 1/2 cup cola soft drink into the hot skillet; scrape up and dissolve any browned bits of food on the bottom of the skillet. Pour hot cola and pan drippings over the brisket; pour remaining cola over meat. If cola does not cover meat, pour in enough water to cover. Drizzle lemon juice into the dish.\nCover dish and bake in the preheated oven for 1 hour. Reduce heat to 325 degrees F (165 degrees C) and cook until meat is very tender, about 3 more hours. Remove brisket and let rest for at least 15 minutes before slicing.\n", "title": "Braised Brisket", "ingredients": ["2 tablespoons olive oil", "6 carrots, peeled and chopped", "1 large onion, chopped", "1 (8 ounce) package fresh mushrooms, quartered", "2 stalks celery, diced", "1/4 cup kosher salt", "1 tablespoon ground black pepper", "1 tablespoon chili powder", "1 tablespoon ground cinnamon", "1 teaspoon ground nutmeg", "1 teaspoon ground allspice", "1/2 teaspoon ground cloves", "1/2 teaspoon ground cayenne pepper (optional)", "1 (4 pound) beef brisket", "3 cups cola soft drink (such as Pepsi®)", "1 cup water, or more as needed to cover (optional)", "2 tablespoons lemon juice"], "minutes": 335}